def main(d):
    # Подаём в словарь строки и преобразуем их в число
    z1 = int(d['z1'])
    z2 = int(d['z2'])
    z3 = int(d['z3'])
    z5 = int(d['z5'])
    z6 = int(d['z6'])
    value = ((z6 << 23) | (z5 << 17) | (z3 <<  9) | (z2 <<  3) | z1)
    # Переводим в 16-тиричную
    return hex(value)

# Тестируем
print(main({'z1': '3',  'z2': '2',  'z3': '11', 'z5': '32', 'z6': '525'}))
print(main({'z1': '5',  'z2': '55', 'z3': '2',  'z5': '53', 'z6': '1016'}))
print(main({'z1': '3',  'z2': '46', 'z3': '43', 'z5': '29', 'z6': '387'}))
print(main({'z1': '3',  'z2': '47', 'z3': '51', 'z5': '40', 'z6': '550'}))