def main(input):
    # конвертируем в число
    num = int(input)
    # Делаем сдвиг и применяем маску
    S5 = (num >> 27) & ((1 << 10) - 1) 
    S4 = (num >> 17) & ((1 << 10) - 1)
    S2 = (num >> 3) & ((1 << 4) - 1) 
    S1 = num & ((1 << 3) - 1) 
    # Селаем сдвиги
    output_num = (S2 << 33) | (S5 << 23) | (S1 << 20) | S4
    return hex(output_num)

# Тесты
print(main('239948252'))        # Ожидаемый результат: '0x1600c00326'
print(main('128390864606'))     # Ожидаемый результат: '0x17de600258'
print(main('51700518902'))      # Ожидаемый результат: '0x1cc0e000cb'
print(main('94668019137'))      # Ожидаемый результат: '0x1160900153'