IVBO = ["ИВБО-10-23", "ИВБО-11-23", "ИВБО-12-23", "ИВБО-20-23", "ИВБО-21-23", "ИВБО-22-23"]
IKBO = ["ИКБО-10-22", "ИКБО-10-23", "ИКБО-11-23", "ИКБО-12-23", "ИКБО-13-23", "ИКБО-14-23", "ИКБО-15-23",
        "ИКБО-20-23", "ИКБО-21-23", "ИКБО-22-23", "ИКБО-23-23", "ИКБО-24-22", "ИКБО-34-23", "ИКБО-40-23",
        "ИКБО-41-23", "ИКБО-42-23", "ИКБО-43-23","ИКБО-50-23", "ИКБО-51-23", "ИКБО-52-23", "ИКБО-60-23",
        "ИКБО-61-23", "ИКБО-62-23", "ИКБО-63-23", "ИКБО-64-23", "ИКБО-65-23", "ИКБО-66-23", "ИКБО-67-23",
        "ИКБО-68-23", "ИКБО-70-23", "ИКБО-71-23", "ИКБО-72-23", "ИКБО-73-23", "ИКБО-74-23", "ИКБО-75-23",
        "ИКБО-76-23"]
IMBO = ["ИМБО-10-23", "ИМБО-11-23"]
INBO = ["ИНБО-10-23", "ИНБО-11-23", "ИНБО-12-23", "ИНБО-13-23", "ИНБО-20-23", "ИНБО-21-23",
        "ИНБО-22-23", "ИНБО-23-23", "ИНБО-30-23", "ИНБО-31-23", "ИНБО-32-23"]


def main():
    groups = {"ИВБО\n": IVBO, "ИКБО\n": IKBO, "ИМБО\n": IMBO, "ИНБО\n": INBO}

    for key, values in groups.items():
        print(key, end="")
        for i in range(0, len(values), 10):
            print(" ".join(values[i:i + 10]))
        print()

if __name__ == "__main__":
    main()
